Tekla Open API Reference for Tekla Structures 2025
StraightDimensionSet.StraightDimensionSetAttributes.CombinedDimension Property
 Combines the attributes of the dimension.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DimensionSetBaseAttributes.CombinedDimensionAttributes CombinedDimension { get; set; }
Public Property CombinedDimension As DimensionSetBaseAttributes.CombinedDimensionAttributes
	Get
	Set
Property Value
Type: DimensionSetBaseAttributes.CombinedDimensionAttributes
See Also
Reference
StraightDimensionSet.StraightDimensionSetAttributes Class
Tekla.Structures.Drawing Namespace